apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_spi_mem_reg.h
#define SPI_MEM_FLASH_RES    (BIT(20))
#define SPI_MEM_FLASH_RES_M  (BIT(20))
#define SPI_MEM_FLASH_RES_V  0x1
#define SPI_MEM_FLASH_RES_S  20

/* SPI_MEM_FLASH_HPM : R/W/SC ;bitpos:[19] ;default: 1'b0 ; */

/* Description: Drive Flash into high performance mode.  The bit will be
 * cleared once the operation done.1: enable 0: disable.
 */

#define SPI_MEM_FLASH_HPM    (BIT(19))
#define SPI_MEM_FLASH_HPM_M  (BIT(19))
#define SPI_MEM_FLASH_HPM_V  0x1
#define SPI_MEM_FLASH_HPM_S  19

/* SPI_MEM_USR : R/W/SC ;bitpos:[18] ;default: 1'b0 ; */

/* Description: User define command enable.  An operation will be triggered
 * when the bit is set. The bit will be cleared once the operation done.1:
 * enable 0: disable.
 */

#define SPI_MEM_USR    (BIT(18))
#define SPI_MEM_USR_M  (BIT(18))
#define SPI_MEM_USR_V  0x1
#define SPI_MEM_USR_S  18

/* SPI_MEM_FLASH_PE : R/W/SC ;bitpos:[17] ;default: 1'b0 ; */

/* Description: In user mode, it is set to indicate that program/erase
 * operation will be triggered. The bit is combined with SPI_MEM_USR bit. The
 * bit will be cleared once the operation done.1: enable 0: disable.
 */

#define SPI_MEM_FLASH_PE    (BIT(17))
#define SPI_MEM_FLASH_PE_M  (BIT(17))
#define SPI_MEM_FLASH_PE_V  0x1
#define SPI_MEM_FLASH_PE_S  17

#define SPI_MEM_ADDR_REG(i)          (REG_SPI_MEM_BASE(i) + 0x4)

/* SPI_MEM_USR_ADDR_VALUE : R/W ;bitpos:[31:0] ;default: 32'h0 ; */

/* Description: In user mode, it is the memory address. other then the
 * bit0-bit23 is the memory address, the bit24-bit31 are the byte length of a
 * transfer.
 */

#define SPI_MEM_USR_ADDR_VALUE    0xFFFFFFFF
#define SPI_MEM_USR_ADDR_VALUE_M  ((SPI_MEM_USR_ADDR_VALUE_V)<<(SPI_MEM_USR_ADDR_VALUE_S))
#define SPI_MEM_USR_ADDR_VALUE_V  0xFFFFFFFF
#define SPI_MEM_USR_ADDR_VALUE_S  0

#define SPI_MEM_CTRL_REG(i)          (REG_SPI_MEM_BASE(i) + 0x8)

/* SPI_MEM_FREAD_QIO : R/W ;bitpos:[24] ;default: 1'b0 ; */

/* Description: In hardware 0xEB read operation, ADDR phase and DIN phase
 * apply 4 signals(4-bit-mode).
 * 1: enable
 * 0: disable.
 */

#define SPI_MEM_FREAD_QIO    (BIT(24))
#define SPI_MEM_FREAD_QIO_M  (BIT(24))
#define SPI_MEM_FREAD_QIO_V  0x1
#define SPI_MEM_FREAD_QIO_S  24

/* SPI_MEM_FREAD_DIO : R/W ;bitpos:[23] ;default: 1'b0 ; */

/* Description: In hardware 0xBB read operation, ADDR phase and DIN phase
 * apply 2 signals(2-bit-mode).
 * 1: enable
 * 0: disable.
 */

#define SPI_MEM_FREAD_DIO    (BIT(23))
#define SPI_MEM_FREAD_DIO_M  (BIT(23))
#define SPI_MEM_FREAD_DIO_V  0x1
#define SPI_MEM_FREAD_DIO_S  23

/* SPI_MEM_WRSR_2B : R/W ;bitpos:[22] ;default: 1'b0 ; */

/* Description: Two bytes data will be written to status register when it is
 * set.
 * 1: enable
 * 0: disable.
 */

#define SPI_MEM_WRSR_2B    (BIT(22))
#define SPI_MEM_WRSR_2B_M  (BIT(22))
#define SPI_MEM_WRSR_2B_V  0x1
#define SPI_MEM_WRSR_2B_S  22

/* SPI_MEM_WP_REG : R/W ;bitpos:[21] ;default: 1'b1 ; */

/* Description: Write protect signal output when SPI is idle.
 * 1: output high,
 * 0: output low.
 */

#define SPI_MEM_WP_REG    (BIT(21))
#define SPI_MEM_WP_REG_M  (BIT(21))
#define SPI_MEM_WP_REG_V  0x1
#define SPI_MEM_WP_REG_S  21

/* SPI_MEM_FREAD_QUAD : R/W ;bitpos:[20] ;default: 1'b0 ; */

/* Description: In hardware 0x6B read operation, DIN phase apply 4
 * signals(4-bit-mode).
 * 1: enable
 * 0: disable.
 */

#define SPI_MEM_FREAD_QUAD    (BIT(20))
#define SPI_MEM_FREAD_QUAD_M  (BIT(20))
#define SPI_MEM_FREAD_QUAD_V  0x1
#define SPI_MEM_FREAD_QUAD_S  20

/* SPI_MEM_D_POL : R/W ;bitpos:[19] ;default: 1'b1 ; */

/* Description: The bit is used to set MOSI line polarity,
 * 1: high
 * 0: low
 */

#define SPI_MEM_D_POL    (BIT(19))
#define SPI_MEM_D_POL_M  (BIT(19))
#define SPI_MEM_D_POL_V  0x1
#define SPI_MEM_D_POL_S  19

/* SPI_MEM_Q_POL : R/W ;bitpos:[18] ;default: 1'b1 ; */

/* Description: The bit is used to set MISO line polarity
 * 1: high
 * 0: low
 */

#define SPI_MEM_Q_POL    (BIT(18))
#define SPI_MEM_Q_POL_M  (BIT(18))
#define SPI_MEM_Q_POL_V  0x1
#define SPI_MEM_Q_POL_S  18

/* SPI_MEM_RESANDRES : R/W ;bitpos:[15] ;default: 1'b1 ; */

/* Description: The Device ID is read out to SPI_MEM_RD_STATUS register, this
 * bit combine with spi_mem_flash_res bit.
 * 1: enable
 * 0: disable.
 */

#define SPI_MEM_RESANDRES    (BIT(15))
#define SPI_MEM_RESANDRES_M  (BIT(15))
#define SPI_MEM_RESANDRES_V  0x1
#define SPI_MEM_RESANDRES_S  15

/* SPI_MEM_FREAD_DUAL : R/W ;bitpos:[14] ;default: 1'b0 ; */

/* Description: In hardware 0x3B read operation, DIN phase apply 2 signals.
 * 1: enable
 * 0: disable
 */

#define SPI_MEM_FREAD_DUAL    (BIT(14))
#define SPI_MEM_FREAD_DUAL_M  (BIT(14))
#define SPI_MEM_FREAD_DUAL_V  0x1
#define SPI_MEM_FREAD_DUAL_S  14

/* SPI_MEM_FASTRD_MODE : R/W ;bitpos:[13] ;default: 1'b1 ; */

/* Description: This bit should be set when SPI_MEM_FREAD_QIO,
 * SPI_MEM_FREAD_DIO, SPI_MEM_FREAD_QUAD or SPI_MEM_FREAD_DUAL is set.
 */

#define SPI_MEM_FASTRD_MODE    (BIT(13))
#define SPI_MEM_FASTRD_MODE_M  (BIT(13))
#define SPI_MEM_FASTRD_MODE_V  0x1
#define SPI_MEM_FASTRD_MODE_S  13

/* SPI_MEM_TX_CRC_EN : R/W ;bitpos:[11] ;default: 1'b0 ; */

/* Description: For SPI1,  enable crc32 when writing encrypted data to flash.
 * 1: enable
 * 0:disable
 */

#define SPI_MEM_TX_CRC_EN    (BIT(11))
#define SPI_MEM_TX_CRC_EN_M  (BIT(11))
#define SPI_MEM_TX_CRC_EN_V  0x1
#define SPI_MEM_TX_CRC_EN_S  11

/* SPI_MEM_FCS_CRC_EN : R/W ;bitpos:[10] ;default: 1'b0 ; */

/* Description: For SPI1,  initialize crc32 module before writing encrypted
 * data to flash. Active low.
 */

#define SPI_MEM_FCS_CRC_EN    (BIT(10))
#define SPI_MEM_FCS_CRC_EN_M  (BIT(10))
#define SPI_MEM_FCS_CRC_EN_V  0x1
#define SPI_MEM_FCS_CRC_EN_S  10

/* SPI_MEM_FCMD_OCT : R/W ;bitpos:[9] ;default: 1'b0 ; */

/* Description: Set this bit to enable 8-bit-mode(8-bm) in CMD phase. */

#define SPI_MEM_FCMD_OCT    (BIT(9))
#define SPI_MEM_FCMD_OCT_M  (BIT(9))
#define SPI_MEM_FCMD_OCT_V  0x1
#define SPI_MEM_FCMD_OCT_S  9

/* SPI_MEM_FCMD_QUAD : R/W ;bitpos:[8] ;default: 1'b0 ; */

/* Description: Set this bit to enable 4-bit-mode(4-bm) in CMD phase. */

#define SPI_MEM_FCMD_QUAD    (BIT(8))
#define SPI_MEM_FCMD_QUAD_M  (BIT(8))
#define SPI_MEM_FCMD_QUAD_V  0x1
#define SPI_MEM_FCMD_QUAD_S  8

