apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_spi_mem_reg.h
/* Description: SPI_DQS input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DINS_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DINS_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge. 3: Delay for (SPI_MEM_DINS_NUM+1)
 * cycles at HCLK positive edge and one cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DINS_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge. 5: Delay for (SPI_MEM_DINS_NUM+1)
 * cycles at HCLK negative edge and one cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DINS_MODE    0x00000007
#define SPI_MEM_DINS_MODE_M  ((SPI_MEM_DINS_MODE_V)<<(SPI_MEM_DINS_MODE_S))
#define SPI_MEM_DINS_MODE_V  0x7
#define SPI_MEM_DINS_MODE_S  24

/* SPI_MEM_DIN7_MODE : R/W ;bitpos:[23:21] ;default: 3'h0 ; */

/* Description: SPI_IO7 input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 3: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 *    cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge. 5: Delay for (SPI_MEM_DIN$n_NUM+1)
 * cycles at HCLK negative edge and one cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN7_MODE    0x00000007
#define SPI_MEM_DIN7_MODE_M  ((SPI_MEM_DIN7_MODE_V)<<(SPI_MEM_DIN7_MODE_S))
#define SPI_MEM_DIN7_MODE_V  0x7
#define SPI_MEM_DIN7_MODE_S  21

/* SPI_MEM_DIN6_MODE : R/W ;bitpos:[20:18] ;default: 3'h0 ; */

/* Description: SPI_IO6 input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 3: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge. 5: Delay for (SPI_MEM_DIN$n_NUM+1)
 * cycles at HCLK negative edge and one cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN6_MODE    0x00000007
#define SPI_MEM_DIN6_MODE_M  ((SPI_MEM_DIN6_MODE_V)<<(SPI_MEM_DIN6_MODE_S))
#define SPI_MEM_DIN6_MODE_V  0x7
#define SPI_MEM_DIN6_MODE_S  18

/* SPI_MEM_DIN5_MODE : R/W ;bitpos:[17:15] ;default: 3'h0 ; */

/* Description: SPI_IO5 input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 *    cycle at MSPI_CORE_CLK positive edge. 3: Delay for
 *    (SPI_MEM_DIN$n_NUM+1)
 *    cycles at HCLK positive edge and one cycle at MSPI_CORE_CLK negative
 *    edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 *    cycle at MSPI_CORE_CLK positive edge.
 * 5: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 *    cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN5_MODE    0x00000007
#define SPI_MEM_DIN5_MODE_M  ((SPI_MEM_DIN5_MODE_V)<<(SPI_MEM_DIN5_MODE_S))
#define SPI_MEM_DIN5_MODE_V  0x7
#define SPI_MEM_DIN5_MODE_S  15

/* SPI_MEM_DIN4_MODE : R/W ;bitpos:[14:12] ;default: 3'h0 ; */

/* Description: SPI_IO4 input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 3: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 5: Delay for (SPI_MEM_DIN$n_NUM+1)
 * cycles at HCLK negative edge and one cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN4_MODE    0x00000007
#define SPI_MEM_DIN4_MODE_M  ((SPI_MEM_DIN4_MODE_V)<<(SPI_MEM_DIN4_MODE_S))
#define SPI_MEM_DIN4_MODE_V  0x7
#define SPI_MEM_DIN4_MODE_S  12

/* SPI_MEM_DIN3_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */

/* Description: SPI_HD input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge. 3: Delay for (SPI_MEM_DIN$n_NUM+1)
 * cycles at HCLK positive edge and one cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 5: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN3_MODE    0x00000007
#define SPI_MEM_DIN3_MODE_M  ((SPI_MEM_DIN3_MODE_V)<<(SPI_MEM_DIN3_MODE_S))
#define SPI_MEM_DIN3_MODE_V  0x7
#define SPI_MEM_DIN3_MODE_S  9

/* SPI_MEM_DIN2_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */

/* Description: SPI_WP input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 3: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 5: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN2_MODE    0x00000007
#define SPI_MEM_DIN2_MODE_M  ((SPI_MEM_DIN2_MODE_V)<<(SPI_MEM_DIN2_MODE_S))
#define SPI_MEM_DIN2_MODE_V  0x7
#define SPI_MEM_DIN2_MODE_S  6

/* SPI_MEM_DIN1_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */

/* Description: SPI_Q input delay mode.
 * 0: No delay.
 * 1: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at MSPI_CORE_CLK negative edge.
 * 2: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 3: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK positive edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 * 4: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK positive edge.
 * 5: Delay for (SPI_MEM_DIN$n_NUM+1) cycles at HCLK negative edge and one
 * cycle at MSPI_CORE_CLK negative edge.
 */

#define SPI_MEM_DIN1_MODE    0x00000007
#define SPI_MEM_DIN1_MODE_M  ((SPI_MEM_DIN1_MODE_V)<<(SPI_MEM_DIN1_MODE_S))
#define SPI_MEM_DIN1_MODE_V  0x7
#define SPI_MEM_DIN1_MODE_S  3

/* SPI_MEM_DIN0_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */

