apache/nuttx/arch/xtensa/src/esp32s2/hardware/esp32s2_spi_mem_reg.h
#define SPI_MEM_SPI_SMEM_DOUT4_MODE    0x00000007
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_M  ((SPI_MEM_SPI_SMEM_DOUT4_MODE_V)<<(SPI_MEM_SPI_SMEM_DOUT4_MODE_S))
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_V  0x7
#define SPI_MEM_SPI_SMEM_DOUT4_MODE_S  12

/* SPI_MEM_SPI_SMEM_DOUT3_MODE : R/W ;bitpos:[11:9] ;default: 3'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT3_MODE    0x00000007
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_M  ((SPI_MEM_SPI_SMEM_DOUT3_MODE_V)<<(SPI_MEM_SPI_SMEM_DOUT3_MODE_S))
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_V  0x7
#define SPI_MEM_SPI_SMEM_DOUT3_MODE_S  9

/* SPI_MEM_SPI_SMEM_DOUT2_MODE : R/W ;bitpos:[8:6] ;default: 3'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4 output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT2_MODE    0x00000007
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_M  ((SPI_MEM_SPI_SMEM_DOUT2_MODE_V)<<(SPI_MEM_SPI_SMEM_DOUT2_MODE_S))
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_V  0x7
#define SPI_MEM_SPI_SMEM_DOUT2_MODE_S  6

/* SPI_MEM_SPI_SMEM_DOUT1_MODE : R/W ;bitpos:[5:3] ;default: 3'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2 output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT1_MODE    0x00000007
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_M  ((SPI_MEM_SPI_SMEM_DOUT1_MODE_V)<<(SPI_MEM_SPI_SMEM_DOUT1_MODE_S))
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_V  0x7
#define SPI_MEM_SPI_SMEM_DOUT1_MODE_S  3

/* SPI_MEM_SPI_SMEM_DOUT0_MODE : R/W ;bitpos:[2:0] ;default: 3'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT0_MODE    0x00000007
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_M  ((SPI_MEM_SPI_SMEM_DOUT0_MODE_V)<<(SPI_MEM_SPI_SMEM_DOUT0_MODE_S))
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_V  0x7
#define SPI_MEM_SPI_SMEM_DOUT0_MODE_S  0

#define SPI_MEM_SPI_SMEM_DOUT_NUM_REG(i)          (REG_SPI_MEM_BASE(i) + 0x0CC)

/* SPI_MEM_SPI_SMEM_DOUTS_NUM : R/W ;bitpos:[17:16] ;default: 2'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUTS_NUM    0x00000003
#define SPI_MEM_SPI_SMEM_DOUTS_NUM_M  ((SPI_MEM_SPI_SMEM_DOUTS_NUM_V)<<(SPI_MEM_SPI_SMEM_DOUTS_NUM_S))
#define SPI_MEM_SPI_SMEM_DOUTS_NUM_V  0x3
#define SPI_MEM_SPI_SMEM_DOUTS_NUM_S  16

/* SPI_MEM_SPI_SMEM_DOUT7_NUM : R/W ;bitpos:[15:14] ;default: 2'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT7_NUM  0x00000003
#define SPI_MEM_SPI_SMEM_DOUT7_NUM_M  ((SPI_MEM_SPI_SMEM_DOUT7_NUM_V)<<(SPI_MEM_SPI_SMEM_DOUT7_NUM_S))
#define SPI_MEM_SPI_SMEM_DOUT7_NUM_V  0x3
#define SPI_MEM_SPI_SMEM_DOUT7_NUM_S  14

/* SPI_MEM_SPI_SMEM_DOUT6_NUM : R/W ;bitpos:[13:12] ;default: 2'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2 output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4 output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT6_NUM    0x00000003
#define SPI_MEM_SPI_SMEM_DOUT6_NUM_M  ((SPI_MEM_SPI_SMEM_DOUT6_NUM_V)<<(SPI_MEM_SPI_SMEM_DOUT6_NUM_S))
#define SPI_MEM_SPI_SMEM_DOUT6_NUM_V  0x3
#define SPI_MEM_SPI_SMEM_DOUT6_NUM_S  12

/* SPI_MEM_SPI_SMEM_DOUT5_NUM : R/W ;bitpos:[11:10] ;default: 2'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2 output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT5_NUM  0x00000003
#define SPI_MEM_SPI_SMEM_DOUT5_NUM_M  ((SPI_MEM_SPI_SMEM_DOUT5_NUM_V)<<(SPI_MEM_SPI_SMEM_DOUT5_NUM_S))
#define SPI_MEM_SPI_SMEM_DOUT5_NUM_V  0x3
#define SPI_MEM_SPI_SMEM_DOUT5_NUM_S  10

/* SPI_MEM_SPI_SMEM_DOUT4_NUM : R/W ;bitpos:[9:8] ;default: 2'h0 ; */

/* Description: the output signals are delayed by system clock cycles
 * 0: output without delayed
 * 1: output with the posedge of clk_apb
 * 2: output with the negedge of clk_apb
 * 3: output with the posedge of clk_160
 * 4: output with the negedge of clk_160
 * 5: output with the spi_clk high edge
 * 6: output with the spi_clk low edge
 */

#define SPI_MEM_SPI_SMEM_DOUT4_NUM    0x00000003
#define SPI_MEM_SPI_SMEM_DOUT4_NUM_M  ((SPI_MEM_SPI_SMEM_DOUT4_NUM_V)<<(SPI_MEM_SPI_SMEM_DOUT4_NUM_S))
#define SPI_MEM_SPI_SMEM_DOUT4_NUM_V  0x3
#define SPI_MEM_SPI_SMEM_DOUT4_NUM_S  8

